text = "Пайтон є однією з найпопулярніших мов програмування у світі. Завдяки простому синтаксису та широким можливостям, він використовується для розробки веб-додатків, аналізу даних, автоматизації та багатьох інших завдань. Крім того, його легко вивчати як початківцям, так і досвідченим програмістам. Спільнота Пайтон надає багато бібліотек та інструментів, які спрощують роботу над проектами будь-якої складності. Завдяки цьому, мова стає універсальним інструментом для вирішення різноманітних проблем, що виникають у процесі розробки."

# Функції Дмитренко Богдан: lower(), replace(), count()
# Приводимо текст до нижнього регістру
text_lower = text.lower()
print("Текст у нижньому регістрі:", text_lower)

# Замінюємо слово 'Пайтон' на 'Ця мова'
text_replaced = text_lower.replace("пайтон", "ця мова")
print("Замінений текст:", text_replaced)

# Рахуємо кількість входжень слова 'мова'
language_count = text_replaced.count("мова")
print("Кількість входжень слова 'мова':", language_count)

